# Q1. What is the difference between Ordinal Encoding and Label Encoding? Provide an example of when you might choose one over the other.

# ans.. ordinal encoding and label encoding are two tecnique for treansforming categorical data into the numerical data categorical data are that contain label values rather than numeric values such as pet ,color  
# ordinal encoding is  a technique for encoding ordinal varible as integer values . the ordre of the categorices is preserved in the encoded values  ex.. place  with the values  ,first second and third

# Q2. Explain how Target Guided Ordinal Encoding works and provide an example of when you might use it in a machine learning project.

# ans.. target guided ordinal encoding  is change the catogerical data to numrical data 
# worked firstly choose the target and after that change the catogrical data to numrical data ..

# Q3. Define covariance and explain why it is important in statistical analysis. How is covariance calculated?

# ans .. covariance is a measure of the relationship b/w two random variable and to what extent they cahnge together .
# statistical tool investors use to measure the relationship b/w the movemnt of two asset price 
# covariance is calculate by analyzing at return surprises (standard deviation from  the expected return ) or multiplying the correlation b/w the two random variable by the standard deviation of each vriable

# Q4. For a dataset with the following categorical variables: Color (red, green, blue), Size (small, medium, large), and Material (wood, metal, plastic), perform label encoding using Python's scikit-learn library. Show your code and explain the output.

In [2]:
import pandas  as pd 
from sklearn.preprocessing import LabelEncoder

In [6]:
df=pd.DataFrame({
    'color':['red','green','blue'],
    'size':['small','medium','large']
    ,'material':['wood','metal','plastic']
})

In [7]:
df

   color    size material
0    red   small     wood
1  green  medium    metal
2   blue   large  plastic

In [5]:
encoder=LabelEncoder()

In [12]:
encoder.fit_transform(df['color'])

array([2, 1, 0])

In [13]:
df1=pd.DataFrame(encoder.fit_transform(df[['color']]))

C:\ProgramData\anaconda3\lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [14]:
df1

   0
0  2
1  1
2  0

In [15]:
pd.concat([df,df1])

   color    size material    0
0    red   small     wood  NaN
1  green  medium    metal  NaN
2   blue   large  plastic  NaN
0    NaN     NaN      NaN  2.0
1    NaN     NaN      NaN  1.0
2    NaN     NaN      NaN  0.0

In [16]:
encoder.fit_transform(df['size'])

array([2, 1, 0])

In [18]:
df2=pd.DataFrame(encoder.fit_transform(df[['size']]))

C:\ProgramData\anaconda3\lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [19]:
encoder.fit_transform(df['material'])

array([2, 0, 1])

In [20]:
df3=pd.DataFrame(encoder.fit_transform(df[['material']]))

C:\ProgramData\anaconda3\lib\site-packages\sklearn\preprocessing\_label.py:116: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [21]:
pd.concat([df,df1,df2,df3])

   color    size material    0
0    red   small     wood  NaN
1  green  medium    metal  NaN
2   blue   large  plastic  NaN
0    NaN     NaN      NaN  2.0
1    NaN     NaN      NaN  1.0
2    NaN     NaN      NaN  0.0
0    NaN     NaN      NaN  2.0
1    NaN     NaN      NaN  1.0
2    NaN     NaN      NaN  0.0
0    NaN     NaN      NaN  2.0
1    NaN     NaN      NaN  0.0
2    NaN     NaN      NaN  1.0

# Q5. Calculate the covariance matrix for the following variables in a dataset: Age, Income, and Education level. Interpret the results.

In [1]:
 import seaborn as sns

In [2]:
df=sns.load_dataset('titanic')

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df.cov()

C:\Users\himan\AppData\Local\Temp\ipykernel_23952\1545644723.py:1: FutureWarning: The default value of numeric_only in DataFrame.cov is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.cov()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,0.236772,-0.137703,-0.551296,-0.018954,0.032017,6.221787,-0.132720,-0.048451
pclass,-0.137703,0.699015,-4.496004,0.076599,0.012429,-22.830196,0.038494,0.055347
age,-0.551296,-4.496004,211.019125,-4.163334,-2.344191,73.849030,2.012292,1.428550
sibsp,-0.018954,0.076599,-4.163334,1.216043,0.368739,8.748734,-0.136916,-0.315568
parch,0.032017,0.012429,-2.344191,0.368739,0.649728,8.661052,-0.138108,-0.230242
fare,6.221787,-22.830196,73.849030,8.748734,8.661052,2469.436846,-4.428757,-6.613861
adult_male,-0.132720,0.038494,2.012292,-0.136916,-0.138108,-4.428757,0.239723,0.097026
alone,-0.048451,0.055347,1.428550,-0.315568,-0.230242,-6.613861,0.097026,0.239723

In [6]:
df.corr()

C:\Users\himan\AppData\Local\Temp\ipykernel_23952\1134722465.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

# Q6. You are working on a machine learning project with a dataset containing several categorical variables, including "Gender" (Male/Female), "Education Level" (High School/Bachelor's/Master's/PhD), and "Employment Status" (Unemployed/Part-Time/Full-Time). Which encoding method would you use for each variable, and why?

# ans.. the given data set have  the many categorical feature  so i'm using the different diff. meath used the data set  gender  categorical feature  i'm  used the one hot encoding achully  one hot encoding is esaly change the numrical data set 
# education and employment feature i 'm used the ordinal and label encoing  both feature are labled  which is first and secand

# Q7. You are analyzing a dataset with two continuous variables, "Temperature" and "Humidity", and two categorical variables, "Weather Condition" (Sunny/Cloudy/Rainy) and "Wind Direction" (North/South/ East/West). Calculate the covariance between each pair of variables and interpret the results.

#  ans . firstly i'm 2 catogrical feature change trhe numrical data  becauce  cov.. and corr.. not worke the catogrical data  so change the numrical feature  and after that   relation the all feature .